MODEL SUMMARY
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_5 (Conv1D)            (None, 26, 60)            180       
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 26, 60)            7260      
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 13, 60)            0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 13, 80)            9680      
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 13, 80)            12880     
_________________________________________________________________
flatten_2 (Flatten)          (None, 1040)              0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 1040)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 200)               208200    
_________________________________________________________________
dropout_4 (Dropout)          (None, 200)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 4)                 804       
=================================================================
Total params: 239,004
Trainable params: 239,004
Non-trainable params: 0
_________________________________________________________________

Optimizer : <keras.optimizers.Adam object at 0x7f32497bcc50>



Test accuracy = 0.996

CLASSIFICATION REPORT
              precision    recall  f1-score   support

           0       1.00      0.99      0.99       733
           1       0.99      1.00      1.00       700
           2       0.99      1.00      1.00       763
           3       1.00      1.00      1.00       732

    accuracy                           1.00      2928
   macro avg       1.00      1.00      1.00      2928
weighted avg       1.00      1.00      1.00      2928


FILE PATHS
Training set : sets_labels/MFCC/1hr/1000ms/train_set.csv
Testing set : sets_labels/MFCC/1hr/1000ms/test_set.csv
Weight file : models/MFCC/1D-CNN/1000ms/1d_cnn_v2.hdf5
Scaler file : models/MFCC/1D-CNN/1000ms/scaler_1d_cnn_v2.sav
CM plot file : plots/MFCC/1D-CNN/1000ms/1d_cnn_v2.png
